<template>
    <div class="container items-center px-[200px] py-6">
        <div class="text-3xl"><span style="font-weight:bold">All AI</span> 用户服务协议</div>
        <div>
            <div class="mb-4">用户注册协议 “<span style="font-weight:bold">All AI</span>”用户服务协议</div>
            <div class="mb-1">本协议生效日期： 2024 年4 月 11 日</div>
            <div class="mb-1">本协议版本：2024 v1.0.0</div>
            <div class="mb-4">本协议更新日期：2024年4月11日</div>

            <div class="mb-4">
                您在申请注册流程中点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。免除或者限制责任的条款将以粗体标识，您应重点阅读。如您对协议有任何疑问，可向
                <span style="font-weight:bold">All AI</span>平台客服咨询。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。
            </div>


            <div class="mb-2 text-2xl">一、重要提示</div>


            <div class="mb-2">
                “<span style="font-weight:bold">All AI</span>”软件及相关服务，是指易速海科技及关联方（以下简称为“我们”）合法拥有并运营的、标注名称为“
                <span style="font-weight:bold">All AI</span>”或“<span style="font-weight:bold">All AI</span>”
                的公众号、小程序、H5网页，以及APP客户端应用程序向您提供的产品与服务（以下简称“<span style="font-weight:bold">All AI</span>”）。
            </div>

            <div class="mb-2">
                《“<span style="font-weight:bold">All
                    AI</span>”用户服务协议》（以下简称“本协议”或”用户协议“）是您与我们就您下载、安装、注册、登录、使用（以下统称“使用”）“
                <span style="font-weight:bold">All AI</span>”、“<span style="font-weight:bold">All
                    AI</span>”APP软件、公众号、小程序、H5网页，并获得“
                <span style="font-weight:bold">All AI</span>”软件提供的相关服务所订立的协议。
            </div>

            <div class="mb-2">
                请您（以下亦称“用户”）在使用 “All
                AI”软件及相关服务，或者申请注册流程时仔细阅读本协议之全部条款，并确认您已完全理解本协议之规定，尤其是免除或者限制您责任的条款、对您权利进行限制的条款、争议解决条款、法律适用等条款。限制、免责条款或者其他涉及您重大权益的条款可能以加粗、加下划线等形式提示您重点注意。如您对本协议有任何疑问，请立即停止使用我们的“All
                AI”软件及相关服务，或者停止注册用户。
            </div>

            <div class="mb-2">
                如您因年龄、智力等因素而不具有完全民事行为能力，请您在法定监护人陪同下仔细阅读并充分理解本协议，并征得法定监护人的同意后使用“<span style="font-weight:bold">All
                    AI</span>”软件及相关服务。
            </div>

            <div class="mb-4">
                如对本协议内容有任何疑问、意见或建议，您可通过发送邮件至admin@aijuli.com与我们联系。
            </div>

            <div class="mb-2 text-2xl">二、协议的接受与变更</div>
            <div class="mb-2">
                请您在使用“<span style="font-weight:bold">All AI</span>”软件及相关服务或注册前充分阅读并且理解本协议，当您开始使用“<span
                    style="font-weight:bold">All AI</span>”软件及相关服务，或注册用户的，将视为您充分理解并签署了本协议，并同意作为本协议的一方当事人接受本协议以及其他与
                “<span style="font-weight:bold">All AI</span>”软件及相关服务的协议和规则（包括但不限于《隐私信息保护政策》）的约束。
            </div>

            <div class="mb-2">
                考虑到互联网服务不断高速发展和演进，您同意我们有权利对本协议进行修改，协议修改后，我们将通过在相关页面公布修改的内容或者其他任何合理方式通知您，您同意承担及时阅读确认修改协议的义务。
            </div>

            <div class="mb-2">
                如果您不同意协议的修改，请立即停止访问或使用“<span style="font-weight:bold">All
                    AI</span>”软件及相关服务，或取消已经获得的产品或服务；如果您选择在本协议修改后继续访问或使用“<span style="font-weight:bold">All
                    AI</span>”软件及相关服务，则视为您已接受本协议的修改。
            </div>

            <div class="mb-4">
                您与我们签署的本协议所列明的条款，并不能完全涵盖您与我们所有的权利和义务。您同意我们公布其他声明、规则等均视为本协议之补充协议，为本协议不可分割的组成部分，与本协议具有同等法律效力。
            </div>

            <div class="mb-2 text-2xl">三、服务的内容与方式</div>

            <div class="mb-2">
                您同意，我们有权根据组织架构、相关资质选择其内部合规的服务主体，为广大用户提供技术服务、推广服务等多方面的服务以及相应的产品。
            </div>

            <div class="mb-2">
                由于互联网的高速发展，我们将在未来向用户提供更多的产品或服务，除非另有明确规定外，未来提供的新产品或服务也适用于本协议。
            </div>

            <div class="mb-2">
                我们提供的产品和服务主要包括但不仅限于“
                <span style="font-weight:bold">All
                    AI</span>”软件、课程、社群运营服务等，我们不保证提供的产品或服务一定满足用户的全部需求。我们保留随时修改、中断或终止无偿提供的产品或服务且无需通知用户的权利，且不承担任何责任；
            </div>

            <div class="mb-4">
                您同意，按照本协议约定方式合理合法地使用“<span style="font-weight:bold">All AI</span>”软件及相关服务。除非另有约定，您通过“
                All
                AI”软件及相关服务上传、观看、分享、下载、保存、修改、传播、发布的任何视频、音频、文字、图片及其他内容，仅限您个人的非商业性质用途；未经我们书面同意，您不得有偿或者无偿转让、出借、赠与依本协议条款所取得的用户权利。
            </div>

            <div class="mb-2 text-2xl">四、账户的取得、使用及注销</div>

            <div class="mb-2">
                请您确认，在您注册“<span style="font-weight:bold">All AI</span>”软件及相关服务的用户时以及使用“All
                AI”软件及相关服务时，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果。
            </div>

            <div class="mb-2">
                您有权选择是否成为“<span style="font-weight:bold">All
                    AI</span>”软件及相关服务的注册用户。若您阅读本用户协议，并完成注册，视为您同意我们按本协议及《隐私信息保护政策》收集、使用您的相关信息。
            </div>

            <div class="mb-2">
                您选择注册账号成为“<span style="font-weight:bold">All
                    AI</span>”软件及相关服务的用户时，应按照提示及要求填写或提供资料、信息，并确保资料、信息的真实性、正确性及完整性。如果您的资料、信息发生变化，应及时更改。
            </div>

            <div class="mb-2">
                当您一旦注册成功，即成为“
                All
                AI”软件及相关服务的注册用户。用户名的命名及使用应遵守相关法律法规并符合网络道德。用户名中不能含有任何侮辱、诽谤、淫秽或暴力等侵害他人合法权益或违反公序良俗、法律法规的词语。如您违反前述规定，我们有权随时限制或拒绝您使用该账号，甚至注销该账号。
            </div>

            <div class="mb-2">
                用户注册成功时，您将创建一个账号和密码。您应采取合理措施维护账号和密码的安全，因用户原因导致账号或密码泄露而造成的法律后果由用户负责。用户对由此用户名和密码登入系统后所发生的所有活动和事件负责，并承担由此产生的直接或者间接法律责任，我们不承担任何责任。
            </div>

            <div class="mb-2">
                用户的账号或密码遗失的，可以通过注册信息进行重置密码，以手机号码注册的用户可以凭借手机号码找回原密码。用户若发现账号遭到未授权的使用或存在其他安全漏洞的情况，应立即告知我们。
            </div>

            <div class="mb-2">
                您的注册帐号仅限于您本人使用，未经我们书面同意，禁止以任何形式赠与、借用、出租、转让、售卖或以其他方式许可他人使用该帐号。如果我们发现或者有合理理由认为使用者并非帐号初始注册人，为保障帐号安全，我们有权立即暂停或终止向该注册帐号提供服务，并有权永久禁用该帐号。
            </div>

            <div class="mb-2">
                您有权注销您的账户，当您需要注销账户时，您可发送邮件至admin@aijuli.com帮您处理。
            </div>

            <div class="mb-4">
                请您知悉，您的账户一旦被注销后将造成您无法继续使用您已购买的付费功能或下载使用过程中已生成的数据等，您同意一切后果由您自行承担。
            </div>


            <div class="mb-2 text-2xl">五、用户的权利</div>

            <div class="mb-2">用户有权在注册后获得其个人的账号；</div>


            <div class="mb-2">
                用户有权在注册并登陆后通过其个人账号创建、编辑、删除包含但不仅限于问答历史记录、图片、音频、视频、PDF、思维导图、PPT等；
            </div>

            <div class="mb-4">
                您可以在最多2个设备（“设备”指包括但不限于计算机及移动电话、平板电脑等手持移动终端设备，下同）上使用您的注册账号，同一时间内仅可最多在2个设备上使用您的账号。超过上述范围使用的，我们有权中止或终止对您的服务，您应自行承担超范围使用而导致的任何损失。同时我们保留追究上述超范围使用行为人法律责任的权利。
            </div>


            <div class="mb-2 text-2xl">六、用户的义务</div>
            <div class="mb-2">
                用户承诺并保证遵守《中华人民共和国著作权法》、《中华人民共和国商标法》、《中华人民共和国反不正当竞争法》、《中华人民共和国民法典》、《中华人民共和国广告法》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》及《信息网络传播权保护条例》等有关法律、法规、规章的规定。在任何情况下，我们合理的认为用户有可能违反上述法律、法规、规章的规定，有权不经事先通知终止向该用户提供服务。
            </div>

            <div class="mb-2">
                用户承诺并保证，用户在“All
                AI”软件及相关服务上传的文档、音频、图片或其他内容拥有相应合法的权利。上述文档、音频、图片或其他内容，不侵犯任何第三方的个人信息、肖像权、名誉权、著作权、商标权等权利；不违反用户与第三方所签订的对用户有约束力的法律文件的规定；否则，我们有权对用户发布的信息依法或依据本协议进行删除或屏蔽，并有权不经事先通知终止向该用户提供服务。
            </div>

            <div class="mb-2">
                禁止用户从事以下行为：
            </div>

            <div class="mb-2">
                a.
                涉及反对宪法确定的基本原则的；危害国家安全、泄露国家秘密的；侵犯国家社会集体的和公民的合法权益（包括但不限于：隐私权、名誉权、肖像权、知识产权等）的；损害社会公序良俗的；制作、复制、发行或传播带有煽动抗拒、破坏法律、法规实施的，煽动颠覆国家政权，推翻社会主义制度的，煽动分裂国家、破坏国家统一的，煽动民族仇恨、民族歧视，破坏民族团结的，捏造或者歪曲事实，散布谣言，扰乱社会秩序的，宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的，公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的，损害国家机关信誉的，其他违反法律、法规的内容。
            </div>

            <div class="mb-2">
                b. 冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为与任何人或任何机构有关的。
            </div>
            <div class="mb-2">
                c. 伪造标题或以其他方式操控识别资料，使人误认为该内容为我们所传送的。
            </div>
            <div class="mb-2">
                d.
                将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上载、张贴、发送电子邮件或以其他方式传送或以其他方式侵入本网站及国家计算机信息系统，干扰本网站正常运转；。
            </div>
            <div class="mb-2">
                e. 以技术方式攻击或破坏或改变“<span style="font-weight:bold">All
                    AI</span>”软件及相关服务的部分或全部、或干扰其运行；以非法方式获取或使用我们产品或服务中的任何软件、代码或其他技术或商业信息；禁止用户对“All
                AI”软件及相关服务中运行的任何程序进行反向工程、反向编译、反向汇编或改写。
            </div>
            <div class="mb-2">
                f.
                未经许可使用我们的网站名称、公司名称、商标、商业标识、网页版式或内容、或其他由我们享有知识产权或权利的信息或资料；将我们的产品或服务以任何形式作为从事各种非法活动的场所、平台或媒介。未经我们的书面授权或许可，用户不得以我们或“
                <span style="font-weight:bold">All AI</span>”软件及相关服务的名义从事任何商业活动，也不得以任何形式将“<span
                    style="font-weight:bold">All
                    AI</span>”软件及相关服务作为从事商业活动的场所、平台或媒介，禁止利用在本网站注册的账户进行牟利性经营活动。
            </div>
            <div class="mb-2">
                g.未经我们书面许可、另行签署协议或另行指定可供用户使用的特定商业服务外，用户不得以商业目的使用“<span style="font-weight:bold">All
                    AI</span>”软件及相关服务；不对“All
                AI”软件及相关服务的任何部分或全部进行商业性质利用、复制、拷贝、出售、调查、广告。
            </div>
            <div class="mb-2">
                h.未经我们书面许可、另行签署协议或另行指定可供用户使用的特定商业服务外，用户不得通过“<span style="font-weight:bold">All
                    AI</span>”软件及相关服务发布有关任意第三方的广告宣传内容。

            </div>
            <div class="mb-2">
                I.其他对网络生态造成不良影响的内容，及法律、行政法规禁止的其他内容。
            </div>

            <div class="mb-4">
                用户就其所上传的内容承担全部法律责任。因用户违反法律规定或本协议规定造成违约或侵犯第三方合法权益的，由用户自行解决且我们有权采取必要手段对于违规账户进行暂停使用、封号或直接注销等必要手段维护网站秩序。如果给我们造成损失，我们有权向用户追偿其因此所遭受的全部损失、包括其直接损失、间接损失、预期利益损失等，我们因维权所支出的合理费用（包括但不限于律师费、差旅费、公证费、诉讼费等）均由用户承担。
            </div>

            <div class="mb-2 text-2xl">
                七、用户产生的内容
            </div>
            <div class="mb-2">
                用户在“All
                AI”软件及相关服务中以各种形式发布的一切信息，均应符合国家法律法规等相关规定及网站相关规定，符合社会公序良俗，并不侵犯任何第三方的合法权益。我们有权随时检查您所上传的内容，如果发现您上传的内容不符合前述规定，我们有权删除或重新编辑您所上传的内容。
            </div>

            <div class="mb-2">
                您通过使用我们的工具生成的内容，授予本站及其继任者并转让永久的、全球性的、非排他性的、可再许可的、免费的、免版税的、不可撤销的版权许可，以复制、准备衍生作品、公开展示、公开表演、从属许可，并分发您输入到服务中的文本和图像提示，或根据您的指示由服务产生的资产。本许可在任何一方出于任何原因终止本协议后仍然有效。
            </div>

            <div class="mb-4">
                我们有权对用户上传的内容进行检查、编辑与修改。我们向您提供平台服务，您了解我们平台上的信息系用户自行发布，且可能存在风险和瑕疵。我们将通过依法建立相关检查监控制度尽可能保障您在平台上的合法权益及良好体验。同时，鉴于平台具备存在海量信息及信息网络环境下信息，我们无法逐一审查商品及/或服务的信息，无法逐一审查交易所涉及的商品及/或服务的质量、安全以及合法性、真实性、准确性，对此您应谨慎判断。在任何情况下，我们均不对任何内容承担任何责任，包括但不限于由于任何内容而导致直接或间接损失。用户应自行承担因此产生的一切法律后果，且平台及我们因此受到的损失，有权向用户追偿。我们因维权所支出的合理费用（包括但不限于律师费、差旅费、公证费、诉讼费等）均由用户承担。我们将尽可能保存用户上传的合法内容，但不承诺将为用户保存其上传的内容，用户应自行就前述内容备份。
            </div>

            <div class="mb-2 text-2xl">
                八、用户信息保护
            </div>

            <div class="mb-2">
                我们对保护用户个人信息高度重视，我们将会采取合理的措施保护用户的个人信息。除法律法规规定的情形外，未经用户许可我们不会向第三方公开、透露用户个人信息。在您使用All
                AI”软件及相关服务的过程中，我们可能会收集您在使用服务时提供或因为使用服务而产生的信息，目的是为了向您提供服务、优化我们的服务以及保障您的账号安全等。我们对相关信息将会采取合理的措施，保障您个人信息的安全。
            </div>

            <div class="mb-2">
                您在注册帐号或使用本服务的过程中，可能需要填写一些必要的信息。若国家法律法规或政策有特殊规定的，您需要填写真实的身份信息。若您填写的信息不完整，则无法使用本服务或在使用过程中受到限制。
            </div>

            <div class="mb-2">
                一般情况下，您可随时浏览、修改自己提交的信息，但出于安全性和身份识别（如号码申诉服务等）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。
            </div>

            <div class="mb-2">
                我们非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用本服务前，应事先取得您家长或法定监护人的书面同意。
            </div>

            <div class="mb-2">
                您应对通过本服务了解、接收或可接触到的包括但不限于其他用户在内的任何人的个人信息予以充分尊重。您不应搜集、复制、存储、传播或以其他任何方式使用其他用户的个人信息。对于违反本条约定而产生的一切后果由您自行承担。
            </div>

            <div class="mb-4">
                更多关于您个人信息保护的内容，请参看《隐私信息保护政策》。
            </div>


            <div class="mb-2 text-2xl"> 九、知识产权归属与授权</div>


            <div class="mb-2">
                根据本协议第七条中的许可，在现行法律允许的范围内，您拥有您使用服务创建的所有资产。这不包括放大其他人的图像，这些图像仍归原始资产创建者所有。我们对可能适用干您的现行法律不作任何陈述或保证。如果您想了解有关您所在司法管辖区现行法律状况的更多信息。请咨询您自己的律师。即使在日后您降级或取消您的会员资格，您对您创建的资产的所有权仍然存在。但是，如果您属于以下例外情况，则您不拥有资产。
            </div>

            <div class="mb-2">
                如果您不是付费会员，则您不拥有您创建的资产。
            </div>

            <div class="mb-2">
                请注意: <span style="font-weight:bold">All
                    AI</span>旗下有开放社区，只要您的图像发布在公共环境中。其他人就可以使用和重新混合这些图像，默认情况下，您的图像是公开可见和可重新混合的。如上所述，您授予我们允许这样做的许可。
            </div>

            <div class="mb-2">
                请注意，您在共享或开放空间中制作的任何图像都可以被该平台中的任何人看到。
            </div>

            <div class="mb-2">
                我们在“<span style="font-weight:bold">All
                    AI</span>”软件及相关服务中提供的内容（包括但不限于软件、技术、程序、网页、文字、图片、图像、音频、视频、图表、版面设计、电子文档等）的知识产权属于我们所有。我们提供“
                All
                AI”软件及相关服务时所依托的软件的著作权、专利权及其他知识产权均归我们所有。未经我们许可，任何人不得擅自使用（包括但不限于通过任何机器人、“蜘蛛”、”爬虫”等程序或设备监视、复制、传播、展示、镜像、上载、下载）“
                <span style="font-weight:bold">All AI</span>”软件及相关服务中的内容。
            </div>

            <div class="mb-2">
                用户对“<span style="font-weight:bold">All
                    AI</span>”软件及相关服务中使用的软件有非专有属性使用权，但不得自行或许可任何第三方复制、修改、出售或衍生产品。我们对您的使用许可在任何情况下均不应视为向您转让其知识产权的部分或者全部。
            </div>

            <div class="mb-2">
                经由“All
                AI”软件及相关服务所传送的音频及其他内容，受到著作权法、商标法、专利法或其他法律的保护；除该音频及其他内容的上载用户所享有的著作权，未经我们书面授权许可，第三方不得进行修改、出租、售卖或衍生其他作品。
            </div>

            <div class="mb-2">
                我们对“
                <span style="font-weight:bold">All
                    AI</span>”软件及相关服务中的专有内容、原创内容和其他通过授权取得的独占或者独家内容享有知识产权。未经我们书面许可，任何单位和个人不得私自转载、传播和提供服务或者有其他侵犯我们知识产权的行为。否则将承担法律责任。
            </div>

            <div class="mb-2">
                除非我们收到相反通知，我们将用户视为其上载或发布的内容的版权所有人。用户点击同意本协议，即表明该用户主动将其在任何时间段在
                All
                AI”软件及相关服务中发表的任何形式的内容的著作财产权无偿授权给我们使用，我们有权对前述内容进行复制、下载、编辑、修改、展示及网络传播。同时用户许可我们有权利就任何主体侵权而单独提起诉讼，并获得赔偿。本协议已经构成《著作权法》第二十六条所规定的书面协议，其效力及于用户在平台发布的任何受著作权法保护的内容，无论该内容形成于本协议签订前还是本协议签订后。
            </div>



            <div class="mb-4">
                对于您提供、发布及在使用“All
                AI”服务中形成的除个人信息外的文字、图片、视频、音频等非个人信息，均不会因上传、发布等行为发生知识产权、肖像权等权利的转移，除非我们另行说明，在法律允许的范围内，您免费授予我们及其关联公司非排他的、无地域限制的许可使用（包括存储、使用、复制、修订、编辑、发布、展示、翻译、分发上述信息或制作派生作品，以已知或日后开发的形式、媒体或技术将上述信息纳入其它作品内等）及可再许可第三方使用的权利，以及可以自身名义对第三方侵权行为取证及提起诉讼的权利。
            </div>

            <div class="mb-2 text-2xl">
                十、会员服务协议
            </div>

            <div class="mb-2">
                <span style="font-weight:bold">All
                    AI</span>会员服务（以下简称“会员服务”）是我们提供的有偿网络增值服务（具体的增值服务项目以我们的官方公布的为准）。
            </div>
            <div class="mb-2">
                会员须阅读并确认用户协议和使用方法，同意并遵守与会员服务有关的各服务协议，才能使用会员权利，享有会员服务.
            </div>

            <div class="mb-2">
                （1）用户一旦付费成功，除法律规定的情形及本协议另有约定外，“<span style="font-weight:bold">All
                    AI</span>”不予退费或就账户内的“积分”余额提供任何退还或逆向兑换（即“积分”兑换为人民币或其他货币）服务。
            </div>

            <div class="mb-2">
                （2）用户取消会员服务或停用、终止会员资格，不再享有由我们提供的各项优惠及增值服务，且将不退还会员费及充值的积分。
            </div>

            <div class="mb-2">
                （3）用户通过网络填写并提交注册表，表中所填写的内容与信息必须真实有效，否则我们有权拒绝其申请或撤销其会员资格，并不予任何赔偿或退还会员费。用户的信息发生变化，应及时修改注册的信息，否则由此造成的会员权利不能全面有效行使的责任由会员自己承担，我们有权因此取消其会员资格，并不予任何赔偿或退还会员费及充值的积分。
            </div>

            <div class="mb-2">
                （4）会员服务的所有权和运营权，以及我们的会员制度和活动的解释权均归我们所有。我们享有对会员用户网上一切活动的监督、提示、检查的权利，如会员的行为违反有关法律法规或违反本服务协议的约定，我们享有要求其纠正及追究其责任等权利。
            </div>

            <div class="mb-2">

                （5）会员不得以窃取、利用系统漏洞等非法途径以及在未获我们授权的非法销售我们会员的网站上获取或者购买会员服务，否则我们有权取消用户的会员服务资格。由此引发的问题由用户自行承担，<span
                    style="font-weight:bold">All AI</span>不负任何责任。
            </div>

            <div class="mb-2">
                （6）若会员持续违反本服务协议，或我们认为会员行为有损我们或他人的声誉及利益，我们有权取消该会员的会员资格而无须给与任何补偿，并保留进一步追究该行为法律责任的权利。
            </div>

            <div class="mb-2">
                （7）我们禁止用户私下有偿或无偿转让会员账号及其中的虚拟物品，以免因账号产生纠纷，用户应当自行承担因违反此要求而遭致的任何损失，同时我们保留追究上述行为人法律责任的权利。
            </div>

            <div class="mb-2">
                （8）会员账号使用权仅属于初始申请注册人，禁止账号共享、赠与、借用、租用、转让或售卖，否则我们有权在未经通知的情况下取消用户的会员服务资格，由此带来的损失由用户自行承担。因上述原因导致账号或密码丢失，我们有权不予找回。如发生账号登陆异常，我们将有权在未经通知的情况下对账号采取暂停使用、取消会员服务资格、回收账号等措施，由此带来的损失由用户自行承担。
            </div>

            <div class="mb-4">
                本协议构成您获取和使用相应会员服务的必要前提条件，您应当在仔细阅读并同意本协议的全部内容后获取和使用我们的会员服务，您的使用行为（包括但不限于支付行为/接受赠与、或完成了成为会员的全部程序而在此过程中未向我们提出关于本协议的任何异议、或使用会员服务等）将视为同意本协议的约束。
            </div>

            <div class="mb-2 text-2xl">
                十一、付费相关协议
            </div>

            <div class="mb-2">
                我们尽力提供完善的付费产品、功能或服务的相关内容，提供方式包括但不限于页面提醒和客服服务。您有权在选择购买前，通过以上渠道，充分了解我们的产品功能和使用细则，并根据自身需求自愿选择付费使用您所需要的功能和服务。如因您自身原因（包含但不限于未仔细阅读相关服务协议、使用规则、账号权限等）未能充分了解我们提供的服务，
                <span style="font-weight:bold">All AI</span>不负任何直接或间接赔偿责任。
            </div>

            <div class="mb-2">
                （1）我们提供免费和付费产品供您使用，我们有权依据市场需求调整或新推出付费产品、功能或服务及相关的服务费用。具体调整均以 <span style="font-weight:bold">All
                    AI</span>官方APP或公众号公示为准。
            </div>

            <div class="mb-2">
                （2）您有权自由选择决定是否使用我们的付费产品、功能或服务。我们会尽力但不保证对您的每一次付费操作进行确认提醒，包括但不限于付费金额和服务内容。
            </div>

            <div class="mb-2">
                （3）我们可能要求您跳转第三方支付平台进行支付，若在支付过程中产生支付安全问题，给您造成相应的经济损失，您应自行承担向侵权方追究侵权责任和追究责任不能的后果。我们不负任何直接或间接赔偿责任。
            </div>

            <div class="mb-2">
                （4）用户知悉并同意，我们提供的产品与服务需接入互联网方可使用，因此用户需要自行承担因使用我们的产品及服务而向包括网络运营商在内的第三方支付的相关费用，例如，互联网接入费、手机流量费、手机短信费等。
            </div>

            <div class="mb-2">
                （5）您在购买我们的增值服务（包含但不限于购买会员服务、模板、素材、第三方素材等），因您主观原因（包含但不限于不愿继续持有、非我们的产品或服务问题等）产生的退款行为，我们有权不进行受理。
            </div>

            <div class="mb-2">
                （6）基于互联网的特殊性，我们不担保服务不会中断，对服务的及时性、安全性均不作担保，不承担非因我们的原因导致的责任。
            </div>

            <div class="mb-2">
                我们依据现有技术提供服务，并全力维护网站的正常运行，但我们无法随时预见任何技术上的问题或其他困难，该困难可能导致您的使用受到影响（包含但不限于制作、推广等），您需谨慎了解并评估使用用我们的产品可能带来的风险，如因此类问题产生的退款行为，我们不负任何直接或间接赔偿责任。
            </div>

            <div class="mb-2">
                （7）在任何情况下，我们均无须对任何间接性、后果性、惩戒性、偶然性、特殊性或惩罚性的损害(包括但不限于您因使用我们的服务而遭受损失及对他人造成的损失)承担责任。
            </div>

            <div class="mb-4">
                （8）我们会尽力对您在使用付费产品，功能和服务过程中遇到的问题，提供可行的解决方案，并最终解决您的问题。如非我们的产品、功能和服务问题所导致的使用异常，我们不负任何直接或间接赔偿责任。
            </div>


            <div class="mb-2 text-2xl">
                十二、免责说明
            </div>

            <div class="mb-2">
                您理解并同意，我们作为网络服务提供者，“<span style="font-weight:bold">All
                    AI</span>”软件及相关服务可能会受多种因素的影响或干扰，我们不保证(包括但不限于)：
            </div>

            <div class="mb-2">
                a. “<span style="font-weight:bold">All
                    AI</span>”软件及相关服务完全适合您的使用要求；
            </div>

            <div class="mb-2">
                b. “<span style="font-weight:bold">All
                    AI</span>”软件及相关服务不受干扰，及时、安全、可靠或不出现错误；您用户经由我们取得的任何软件、服务或其他材料符合您的期望；
            </div>

            <div class="mb-2">
                c. ”<span style="font-weight:bold">All
                    AI</span>”软件及相关服务中任何错误都将能得到更正。
            </div>

            <div class="mb-2">
                d.
                如有涉嫌借款、投融资、理财或其他涉财产的网络信息、账户密码、广告或推广等信息的，请您谨慎对待并自行进行判断，对您因此遭受的利润、商业信誉、资料损失或其他有形或无形损失，我们不承担任何直接、间接、附带、特别、衍生性或惩罚性的赔偿责任。
            </div>

            <div class="mb-2">
                e. 理解并同意，在使用”All
                AI”软件及相关服务过程中，可能遇到不可抗力等因素（不可抗力是指不能预见、不能克服并不能避免的客观事件），包括但不限于政府行为、自然灾害（如洪水、地震、台风等）、网络原因、战争、罢工、骚乱等。出现不可抗力情况时，我们将努力在第一时间及时修复，但因不可抗力造成的暂停、中止、终止服务或造成的任何损失，我们在法律法规允许范围内免于承担责任。
            </div>

            <div class="mb-2">
                f. 我们依据本协议约定获得处理违法违规内容的权利，该权利不构成我们的义务或承诺，我们不能保证及时发现违法行为或进行相应处理。
            </div>

            <div class="mb-2">
                g. 您理解并同意：关于“<span style="font-weight:bold">All
                    AI</span>”软件及相关服务，我们不提供任何种类的明示或暗示担保或条件，包括但不限于商业适售性、特定用途适用性等。您对<span style="font-weight:bold">All
                    AI</span>”软件及相关服务的使用行为应自行承担相应风险。
            </div>

            <div class="mb-2">
                h.
                您理解并同意，本协议旨在保障遵守国家法律法规、维护公序良俗，保护用户和他人合法权益，我们在能力范围内尽最大的努力按照相关法律法规进行判断，但并不保证我们判断完全与司法机关、行政机关的判断一致，如因此产生的后果您已经理解并同意自行承担。
            </div>

            <div class="mb-4">
                i. 在任何情况下，我们均不对任何间接性、后果性、惩罚性、偶然性、特殊性或刑罚性的损害，包括因您使用“All
                AI”软件及相关服务而遭受的利润损失，承担责任。除法律法规另有明确规定外，我们对您承担的全部责任，无论因何原因或何种行为方式，始终不超过您因使用”<span
                    style="font-weight:bold">All
                    AI</span>”软件及相关服务而支付给我们的费用（如有）。
            </div>



            <div class="mb-4 text-2xl">
                十三、第三方链接
            </div>

            <div class="mb-4">
                我们可能会提供第三方互联网网站或资源链接，除非另有声明外，我们无法对第三方网站服务进行控制，因此由于下载、传播、使用或依赖上述网站或资源所生的损失或损害，我们不承担任何责任。
            </div>

            <div class="mb-2 text-2xl">
                十四、侵权投诉
            </div>

            <div class="mb-2">
                根据《中华人民共和国民法典》的规定，任何第三方认为，用户利用 “<span style="font-weight:bold">All
                    AI</span>”软件及相关服务侵害其民事权益或实施侵权行为的，被侵权人有权书面通知我们采取删除、屏蔽、断开链接等必要措施。
            </div>

            <div class="mb-4">
                根据《信息网络传播权保护条例》的规定，任何第三方认为，所涉及的作品、表演、录音录像制品，侵犯自己的合法权益的，可以向我们提交书面通知，要求我们删除该侵权作品，或者断开链接。通知书应当包含下列内容：权利人的姓名（名称）、联系方式和地址；权利人的有效权利证明材料。权利人应当对通知书的真实性负责，如果侵权投诉不实，则需承担相应的法律责任。侵权投诉必须包含下述信息：被侵权人的有效权利证明材料，或被侵权作品的原始链接及其它证明材料；侵权信息或作品在平台上的具体名称及链接；侵权投诉人的联络方式，以便我们及时与您取得联系，包括电子邮件地址、电话号码或手机等；投诉内容须纳入以下声明：“本人本着诚信原则，有证据认为该对象侵害本人的合法权益。本人承诺全部投诉信息真实、准确，自愿承担一切后果。”；本人亲笔签名并注明日期，如代理他人投诉的，必须出具授权人签名的授权书。
            </div>

            <div class="mb-2 text-2xl">
                十五、商业活动
            </div>

            <div class="mb-2">
                您理解并接受，我们为
                “All
                AI”软件及相关服务的运营，可以进行下述商业活动：通过电子邮件、客户端、网页或其他合法方式向用户发送推广信息或其他相关商业信息。通过增值服务系统或其他方式向用户发送相关服务信息或其他信息，其他信息包括但不限于通知信息、宣传信息、广告信息等。
            </div>

            <div class="mb-4">
                您理解并接受，我们为了“<span style="font-weight:bold">All
                    AI</span>”软件及相关服务的运营可在平台及相关服务中展示我们或第三方的商业、非商业信息（在我们的产品或服务中的任何位置，包括不限于在播放页贴片、播放页皮肤等位置发布前述信息）。
            </div>

            <div class="mb-2 text-2xl">
                十六、服务的变更、中断、终止
            </div>

            <div class="mb-2">
                您理解并同意，我们提供的“All
                AI”软件及相关服务是按照现有技术和条件所能达到的现状提供的。我们会尽最大努力向您提供服务，确保服务的连贯性和安全性。您理解，我们不能随时或始终预见和防范法律、技术以及其他风险，包括但不限于不可抗力、网络原因、第三方服务瑕疵、第三方网站等原因可能导致的服务中断、不能正常使用All
                AI软件及相关服务以及其他的损失和风险。
            </div>

            <div class="mb-4">
                您理解并同意，我们为了整体服务运营、平台运营安全的需要，有权视具体情况决定服务/功能的设置及其范围修改、中断、中止或终止“<span style="font-weight:bold">All
                    AI</span>”软件及相关服务。
            </div>



            <div class="mb-2 text-2xl">
                十七、法律适用、管辖和其他
            </div>

            <div class="mb-2">
                本协议的生效、履行、解释及争议的解决均适用中华人民共和国法律。用户因使用
                “<span style="font-weight:bold">All
                    AI</span>”软件及相关服务而产生或与之相关的一切争议，权利主张或其他事项，均适用中华人民共和国法律。用户与我们的一切争议，应友好协商，如协商不成的，可向广州仲裁委员会申请仲裁。
            </div>


            <div class="mb-2">
                您同意，我们可以随时发布针对用户的相关协议，并有权将该相关协议作为对本协议的补充或修改而将其内容作为本协议的一部分。请您及时关注并阅读相关协议。
            </div>

            <div class="mb-2">
                本协议任意一条被视为废止、无效或不可执行，该条款应视为可分的且不影响本协议其他条款的法律效力。
            </div>

            <div class="mb-2">
                本协议中的标题仅为方便阅读而设，并不影响本协议中任何规定的含义或解释。
            </div>

            <div class="mb-2">
                您和我们均是独立的主体，在任何情况下本协议不构成我们对您的任何形式的明示或暗示担保或条件，双方之间亦不构成代理、合伙、合营或雇佣关系。
            </div>

            <div class="mb-2">
                【审慎提醒】
                如您使用“<span style="font-weight:bold">All
                    AI</span>”软件及相关服务，或进行用户注册的，将视为您已同意前述服务协议，该等条款将立即生效，并构成您和我们之间有约束力的法律文件，务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款。
            </div>
        </div>
    </div>
</template>

<script lang="ts" setup>

</script>

<style lang="scss" scoped>
.container {
    display: flex;
    flex-direction: column;
}
</style>